RaigK/Mysensors_STM32U083/lib/MySensors_patch/hal/architecture/STM32/MyHwSTM32.cpp
	// Return typical 3.3V if measurement not available
	return 3300;
}

uint16_t hwCPUFrequency(void)
{
	// Return CPU frequency in 0.1 MHz units
	// F_CPU is defined by the build system (e.g., 84000000 for 84 MHz)
	return F_CPU / 100000UL;
}

int8_t hwCPUTemperature(void)
{
#if defined(TEMP_SENSOR_AVAILABLE) && defined(ATEMP) && defined(__HAL_RCC_ADC1_CLK_ENABLE)
	// Read internal temperature sensor
	// Note: Requires calibration values for accurate results

	int32_t temp_raw = analogRead(ATEMP);

#ifdef TEMP110_CAL_ADDR
	// Use factory calibration if available (STM32F4, L4, etc.)
	uint16_t *temp30_cal = (uint16_t *)TEMP30_CAL_ADDR;
	uint16_t *temp110_cal = (uint16_t *)TEMP110_CAL_ADDR;

	if (temp30_cal && temp110_cal && *temp110_cal != *temp30_cal) {
		// Calculate temperature using two-point calibration
		// Formula: T = ((110-30) / (CAL_110 - CAL_30)) * (raw - CAL_30) + 30
		int32_t temp = 30 + ((110 - 30) * (temp_raw - *temp30_cal)) /
		               (*temp110_cal - *temp30_cal);

		// Apply user calibration
		temp = (temp - MY_STM32_TEMPERATURE_OFFSET) / MY_STM32_TEMPERATURE_GAIN;

		return (int8_t)temp;
	}
#endif // TEMP110_CAL_ADDR

	// Fallback: use typical values (less accurate)
	// Typical slope: 2.5 mV/°C, V25 = 0.76V for STM32F4
	// This is a rough approximation
	float voltage = (temp_raw * 3.3f) / 4096.0f;
	int32_t temp = 25 + (int32_t)((voltage - 0.76f) / 0.0025f);

	return (int8_t)((temp - MY_STM32_TEMPERATURE_OFFSET) / MY_STM32_TEMPERATURE_GAIN);
#else
	// Temperature sensor not available
	return FUNCTION_NOT_SUPPORTED;
#endif
}

uint16_t hwFreeMem(void)
{
	// Calculate free heap memory
	// This uses newlib's mallinfo if available

#ifdef STACK_TOP
	extern char *__brkval;
	extern char __heap_start;

	char *heap_end = __brkval ? __brkval : &__heap_start;
	char stack_var;

	// Calculate space between heap and stack
	return (uint16_t)(&stack_var - heap_end);
#else
	// Alternative method: try to allocate and measure
	// Not implemented to avoid fragmentation
	return FUNCTION_NOT_SUPPORTED;
#endif
}

// ======================== Sleep Mode Helper Functions ========================

/**
 * @brief Initialize RTC using STM32RTC library for reliable alarm-based wake-up
 * @return true if successful, false on error
 *
 * Note: The RTC wake-up timer on STM32U0 series does not work reliably.
 * This implementation uses RTC Alarm A instead, which provides reliable
 * timed wake-up from STOP mode.
 */
static bool hwSleepInit(void)
{
	if (rtcInitialized) {
		return true;
	}

	// Use STM32RTC library which handles all the low-level RTC configuration
	rtc.setClockSource(STM32RTC::LSI_CLOCK);
	rtc.begin();

	// Deactivate any stale WUT from a previous firmware run (RTC is battery-backed,
	// survives firmware uploads; a stale armed WUT causes immediate wake from Stop).
	HAL_RTCEx_DeactivateWakeUpTimer(rtc.getHandle());

	rtcInitialized = true;
	return true;
}

/**
 * @brief Configure RTC alarm for specified duration using STM32RTC library
 * @param ms Milliseconds to sleep (0 = disable alarm)
 * @return true if successful, false on error
 */
static bool hwSleepConfigureAlarm(uint32_t ms)
{
	if (!rtcInitialized) {
		if (!hwSleepInit()) {
			return false;
		}
	}

	if (ms == 0) {
		HAL_RTCEx_DeactivateWakeUpTimer(rtc.getHandle());
		return true;
	}

	uint32_t sleepSec = ms / 1000;
	if (sleepSec == 0) sleepSec = 1;
	if (sleepSec > 65535) sleepSec = 65535;  // WUT counter is 16-bit

#if !defined(MY_DISABLED_SERIAL)
	Serial.print("WUT: "); Serial.print(sleepSec); Serial.println("s");
	Serial.flush();
#endif

	// Use RTC Wake-Up Timer (WUT) clocked from ck_spre (1 Hz) — 1-second resolution,
	// plain countdown, no H:M:S or subsecond match quirks. Fires EXTI28 → NVIC IRQ 2.
	// Counter = sleepSec - 1 → wake after sleepSec seconds (counter decrements to 0
	// then wraps, setting WUTF).
	HAL_RTCEx_DeactivateWakeUpTimer(rtc.getHandle());
	if (HAL_RTCEx_SetWakeUpTimer_IT(rtc.getHandle(), sleepSec - 1,
	                                RTC_WAKEUPCLOCK_CK_SPRE_16BITS, 0) != HAL_OK) {
#if !defined(MY_DISABLED_SERIAL)
		Serial.println("WUT setup FAILED");
		Serial.flush();
#endif
		return false;
	}

	alarmTriggered = false;
	return true;
}

/**
 * @brief Restore system clock after wake-up from STOP mode
 */
static void hwSleepRestoreSystemClock(void)
{
	SystemClock_Config();
}

/**
 * @brief Configure unused GPIOs as analog to minimize leakage current
 * @note Pins in use are preserved, all others set to analog mode
 */
static void hwConfigureGpioLowPower(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
	GPIO_InitStruct.Pull = GPIO_NOPULL;

	// Enable all GPIO clocks for configuration
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();

	// PORTA: Keep PA0 (ADC), PA2/PA3 (USART), PA5/PA6/PA7 (SPI), PA10 (RFM69 IRQ)
	// PA13/PA14 (SWDIO/SWCLK) always kept in AF mode so SWD remains accessible in STOP2
	// Set unused: PA1, PA4, PA8, PA9, PA11, PA12, PA15
	GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_8 | GPIO_PIN_9 |
	                      GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_15;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	// PORTB: Keep PB6 (RFM69 CS), PB10/PB11 (I2C2), PB0 (wake indicator, driven LOW before sleep)
	// Set unused: PB1, PB2, PB3, PB4, PB5, PB7, PB8, PB9, PB12-PB15
	GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
	                      GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7 | GPIO_PIN_8 |
	                      GPIO_PIN_9 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	// PORTC: All unused (PC13 is often user button, PC14/PC15 are LSE if used)
	GPIO_InitStruct.Pin = GPIO_PIN_ALL;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	// PORTD: All unused
	GPIO_InitStruct.Pin = GPIO_PIN_ALL;
	HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

	// Disable GPIO clocks for unused ports
	__HAL_RCC_GPIOC_CLK_DISABLE();
	__HAL_RCC_GPIOD_CLK_DISABLE();
}

/**
 * @brief Prepare peripherals for sleep (disable clocks)
 */
static void hwPrepareSleep(void)
{
#if defined(STM32U0xx)
	// STM32U0: DBGMCU clock must be enabled via RCC->DBGCFGR.DBGEN before
	// DBGMCU register writes take effect (unlike most other STM32 families).
	// FORCE DBG_STOP=0 regardless of MY_DEBUG: enabling DBG in Stop keeps clocks
	// running and may interfere with WUT wakeup on STM32U0. SWD upload still works
	// through the 5-second boot window in before() or via Under-Reset upload.
	__HAL_RCC_DBGMCU_CLK_ENABLE();
	DBGMCU->CR = 0;
	__HAL_RCC_DBGMCU_CLK_DISABLE();

