RaigK/Mysensors_STM32U083/lib/MySensors_patch/hal/architecture/STM32/MyHwSTM32.cpp
	// Arm EXTI28 (all RTC events on STM32U0) and internal-wake belt-and-suspenders.
	// EXTI28 is a "direct" line — IMR28=1 is sufficient; RTSR/FTSR have no effect.
	// NVIC IRQ 2 (RTC_TAMP_IRQn) is the actual wake vector; we enable it explicitly
	// in case STM32RTC library hasn't already done so.
	EXTI->IMR1 |= (1UL << 28);
	PWR->CR3   |= PWR_CR3_EIWUL;
	NVIC_ClearPendingIRQ(RTC_TAMP_IRQn);
	NVIC_EnableIRQ(RTC_TAMP_IRQn);

#if !defined(MY_DISABLED_SERIAL)
	// Print BEFORE hwConfigureGpioLowPower sets PA2 (UART TX) to analog — any
	// Serial.print after that is silently lost.
	// RTC_CR bits: bit8=ALRAE, bit10=WUTE, bit12=ALRAIE, bit14=WUTIE
	// RTC_SR bits: bit0=ALRAF, bit2=WUTF
	Serial.print("PRE CR=0x");  Serial.print(RTC->CR, HEX);
	Serial.print(" SR=0x");     Serial.print(RTC->SR, HEX);
	Serial.print(" WUTR=");     Serial.print(RTC->WUTR);
	Serial.print(" ICSR=0x");   Serial.print(RTC->ICSR, HEX);
	Serial.print(" PREDIV=0x"); Serial.print(RTC->PRER, HEX);
	Serial.print(" CR3=0x");    Serial.print(PWR->CR3, HEX);
	Serial.print(" IMR28=");    Serial.print((EXTI->IMR1 >> 28) & 1);
	Serial.print(" NVIC2=");    Serial.print(NVIC_GetEnableIRQ(RTC_TAMP_IRQn));
	Serial.print(" t=");        Serial.print(rtc.getHours());
	Serial.print(":");          Serial.print(rtc.getMinutes());
	Serial.print(":");          Serial.println(rtc.getSeconds());
	Serial.flush();
#endif
#endif

	// GPIOs to analog and peripheral clocks off — DO THIS LAST (kills UART TX).
	hwConfigureGpioLowPower();
	__HAL_RCC_SPI1_CLK_DISABLE();
	__HAL_RCC_I2C1_CLK_DISABLE();
	__HAL_RCC_I2C2_CLK_DISABLE();
	__HAL_RCC_ADC_CLK_DISABLE();
}

/**
 * @brief Restore peripherals after wake-up
 */
static void hwRestoreAfterSleep(void)
{
	// Re-enable GPIO clocks
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();

	// Re-enable peripheral clocks
	__HAL_RCC_SPI1_CLK_ENABLE();
	__HAL_RCC_I2C1_CLK_ENABLE();
	__HAL_RCC_I2C2_CLK_ENABLE();
	__HAL_RCC_ADC_CLK_ENABLE();

	// Reinitialize SPI1 pins (PA5=SCK, PA6=MISO, PA7=MOSI)
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	// Reinitialize PB0 (wake indicator) as output LOW — app code drives it HIGH after return
	GPIO_InitStruct.Pin = GPIO_PIN_0;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);  // keep LOW until app drives HIGH

	// Reinitialize RFM69 CS pin (PB6)
	GPIO_InitStruct.Pin = GPIO_PIN_6;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);  // CS high (inactive)

	// Reinitialize RFM69 IRQ pin (PA10)
	GPIO_InitStruct.Pin = GPIO_PIN_10;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	// Reinitialize I2C2 pins (PB10=SCL, PB11=SDA)
	GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_11;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF4_I2C2;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	// Reinitialize ADC pin (PA0)
	GPIO_InitStruct.Pin = GPIO_PIN_0;
	GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

/**
 * @brief Enter the configured sleep mode
 * @note Sleep mode is selected at compile time via MY_STM32_SLEEP_MODE
 */
static void hwEnterSleepMode(void)
{
#if MY_STM32_SLEEP_MODE == POWER_SLEEP_SLEEP
	// ==================== Sleep Mode ====================
	// CPU halted, peripherals running, fast wake-up
	// Current: ~1 mA (varies with peripherals enabled)
	HAL_SuspendTick();
	HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
	HAL_ResumeTick();

#elif MY_STM32_SLEEP_MODE == POWER_SLEEP_LP_SLEEP
	// ==================== Low Power Sleep Mode ====================
	// Requires Low Power Run mode (2 MHz MSI)
	// CPU halted, LP regulator, limited peripherals
	// Current: ~100-200 µA
	HAL_SuspendTick();
	HAL_PWR_EnterSLEEPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI);
	HAL_ResumeTick();

#elif MY_STM32_SLEEP_MODE == POWER_SLEEP_STOP0
	// ==================== Stop 0 Mode ====================
	// Fast wake-up, SRAM retained
	// Current: ~10-20 µA
	HAL_SuspendTick();
#if defined(STM32U0xx)
	HAL_PWREx_EnterSTOP0Mode(PWR_STOPENTRY_WFI);
#else
	HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFI);
#endif
	hwSleepRestoreSystemClock();
	HAL_ResumeTick();

#elif MY_STM32_SLEEP_MODE == POWER_SLEEP_STOP1
	// ==================== Stop 0 Mode (manual — U0 HAL lacks wrapper) ==========
	// LPMS=0b000 = Stop 0: main regulator stays ON, least disruption to peripherals.
	// STM32U0 HAL only provides HAL_PWREx_EnterSTOP1Mode / EnterSTOP2Mode, so Stop 0
	// must be entered by hand. If Stop 1's LP-regulator transition is what blocks
	// WUT wake, Stop 0 should wake reliably.
	HAL_SuspendTick();
#if defined(STM32U0xx)
	GPIOB->BRR = GPIO_PIN_0;  // LED OFF — goes back ON after WFI if we wake
	MODIFY_REG(PWR->CR1, PWR_CR1_LPMS, 0);            // LPMS=000 (Stop 0)
	SET_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);
	__WFI();
	CLEAR_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);
	GPIOB->BSRR = GPIO_PIN_0;  // LED ON immediately after WFI returns
#else
	HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
#endif
	hwSleepRestoreSystemClock();
	HAL_ResumeTick();

#elif MY_STM32_SLEEP_MODE == POWER_SLEEP_STOP2
	// ==================== Stop 2 Mode ====================
	// Lowest Stop power, limited peripherals
	// Current: ~1-3 µA
	HAL_SuspendTick();
#if defined(STM32U0xx)
	HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
#else
	// Fallback to Stop 1 if Stop 2 not available
	HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
#endif
	hwSleepRestoreSystemClock();
	HAL_ResumeTick();

