RaigK/Mysensors_STM32U083/lib/MySensors_patch/hal/architecture/STM32/MyHwSTM32.cpp
#elif MY_STM32_SLEEP_MODE == POWER_SLEEP_STANDBY
	// ==================== Standby Mode ====================
	// Lowest power, RAM lost, only RTC/IWDG preserved
	// Current: ~300 nA
	// WARNING: System will reset on wake-up!
#if defined(STM32U0xx)
	// Enable WKUP pin if needed (e.g., PA0)
	// HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1);
	HAL_PWR_EnterSTANDBYMode();
#else
	HAL_PWR_EnterSTANDBYMode();
#endif
	// Will not reach here - system resets on wake

#else
	// Default fallback to Stop 1
	HAL_SuspendTick();
	HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
	hwSleepRestoreSystemClock();
	HAL_ResumeTick();
#endif
}

/**
 * @brief ISR for wake-up interrupt 1
 */
static void wakeUp1ISR(void)
{
	_wokeUpByInterrupt = _wakeUp1Interrupt;
}

/**
 * @brief ISR for wake-up interrupt 2
 */
static void wakeUp2ISR(void)
{
	_wokeUpByInterrupt = _wakeUp2Interrupt;
}

// ======================== Public Sleep Functions ========================

uint32_t hwGetSleepRemaining(void)
{
	return sleepRemainingMs;
}

int8_t hwSleep(uint32_t ms)
{
#if !defined(MY_DISABLED_SERIAL)
	Serial.print("Sleep ");
	Serial.print(ms / 1000);
	Serial.println("s");
	Serial.flush();
#endif

	// Sleep/LP Sleep modes don't need RTC for timed wake-up with short durations
	// but we use RTC alarm for consistent behavior across all modes
#if MY_STM32_SLEEP_MODE != POWER_SLEEP_STANDBY
	// Initialize RTC if needed (not needed for Standby with WKUP pin only)
	if (!rtcInitialized) {
		if (!hwSleepInit()) {
#if !defined(MY_DISABLED_SERIAL)
			Serial.println("RTC init FAILED");
#endif
			return MY_SLEEP_NOT_POSSIBLE;
		}
	}

	// Configure RTC alarm for wake-up
	if (ms > 0) {
		if (!hwSleepConfigureAlarm(ms)) {
#if !defined(MY_DISABLED_SERIAL)
			Serial.println("Alarm config FAILED");
#endif
			return MY_SLEEP_NOT_POSSIBLE;
		}
	}
#endif

	// Reset sleep remaining
	sleepRemainingMs = 0ul;

	// Clear any pending wake-up flags
	__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

#if !defined(MY_DISABLED_SERIAL)
	Serial.flush();
	delay(10);
#endif

	// Prepare peripherals for sleep
	hwPrepareSleep();

	// Enter the configured sleep mode
	hwEnterSleepMode();

	// ========== WOKE UP ==========

	// Restore peripherals
	hwRestoreAfterSleep();

#if !defined(MY_DISABLED_SERIAL)
	Serial.print("POST SR=0x"); Serial.print(RTC->SR, HEX);
	Serial.print(" alrm=");     Serial.print(alarmTriggered);
	Serial.print(" t=");        Serial.print(rtc.getHours());
	Serial.print(":");          Serial.print(rtc.getMinutes());
	Serial.print(":");          Serial.println(rtc.getSeconds());
	Serial.flush();
#endif

#if MY_STM32_SLEEP_MODE != POWER_SLEEP_STANDBY
	// Disable WUT and clear its flag so it doesn't re-arm before next sleep.
	HAL_RTCEx_DeactivateWakeUpTimer(rtc.getHandle());
	WRITE_REG(RTC->SCR, RTC_SCR_CWUTF);
	__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
#endif

	return MY_WAKE_UP_BY_TIMER;
}

int8_t hwSleep(const uint8_t interrupt, const uint8_t mode, uint32_t ms)
{
	// Delegate to dual-interrupt variant with INVALID second interrupt
	return hwSleep(interrupt, mode, INVALID_INTERRUPT_NUM, 0, ms);
}

int8_t hwSleep(const uint8_t interrupt1, const uint8_t mode1,
               const uint8_t interrupt2, const uint8_t mode2, uint32_t ms)
{
#if !defined(MY_DISABLED_SERIAL)
	Serial.print("Sleep ");
	Serial.print(ms / 1000);
	Serial.print("s i1=");
	Serial.print(interrupt1);
	Serial.print(" i2=");
	Serial.println(interrupt2);
	Serial.flush();
#endif

#if MY_STM32_SLEEP_MODE != POWER_SLEEP_STANDBY
	// Initialize RTC if needed
	if (!rtcInitialized) {
		if (!hwSleepInit()) {
#if !defined(MY_DISABLED_SERIAL)
			Serial.println("RTC init FAILED");
#endif
			return MY_SLEEP_NOT_POSSIBLE;
		}
	}

	// Configure RTC alarm for wake-up (if ms > 0)
	if (ms > 0) {
		if (!hwSleepConfigureAlarm(ms)) {
#if !defined(MY_DISABLED_SERIAL)
			Serial.println("Alarm config FAILED");
#endif
			return MY_SLEEP_NOT_POSSIBLE;
		}
	}
#endif

	// Reset sleep remaining
	sleepRemainingMs = 0ul;

	// Configure interrupt wake-up sources
	_wakeUp1Interrupt = interrupt1;
	_wakeUp2Interrupt = interrupt2;
	_wokeUpByInterrupt = INVALID_INTERRUPT_NUM;

	// Attach interrupts
	MY_CRITICAL_SECTION {
		if (interrupt1 != INVALID_INTERRUPT_NUM) {
			attachInterrupt(interrupt1, wakeUp1ISR, mode1);
		}
		if (interrupt2 != INVALID_INTERRUPT_NUM) {
			attachInterrupt(interrupt2, wakeUp2ISR, mode2);
		}
	}

	// Clear wake-up flags
	__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

#if !defined(MY_DISABLED_SERIAL)
	Serial.flush();
	delay(10);
#endif

	// Prepare peripherals for sleep
	hwPrepareSleep();

	// Enter the configured sleep mode
	hwEnterSleepMode();

	// ========== WOKE UP ==========

	// Restore peripherals
	hwRestoreAfterSleep();

#if !defined(MY_DISABLED_SERIAL)
	Serial.println("Woke");
	Serial.flush();
#endif

	// Detach interrupts
	if (interrupt1 != INVALID_INTERRUPT_NUM) {
		detachInterrupt(interrupt1);
	}
	if (interrupt2 != INVALID_INTERRUPT_NUM) {
		detachInterrupt(interrupt2);
	}

#if MY_STM32_SLEEP_MODE != POWER_SLEEP_STANDBY
	// Disable WUT and clear its flag
	HAL_RTCEx_DeactivateWakeUpTimer(rtc.getHandle());
	WRITE_REG(RTC->SCR, RTC_SCR_CWUTF);
	__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
#endif

	// Determine wake-up source
	int8_t ret = MY_WAKE_UP_BY_TIMER;
	if (_wokeUpByInterrupt != INVALID_INTERRUPT_NUM) {
		ret = (int8_t)_wokeUpByInterrupt;
	}

	// Reset interrupt tracking
	_wokeUpByInterrupt = INVALID_INTERRUPT_NUM;
	_wakeUp1Interrupt = INVALID_INTERRUPT_NUM;
	_wakeUp2Interrupt = INVALID_INTERRUPT_NUM;

	return ret;
}
